class Config:
    PATH = "D:\projects\scrawling\driver\chromedriver.exe"

    DIANA = "https://space.bilibili.com/672328094"
    CAROL = "https://space.bilibili.com/351609538"
    EILEEN = "https://space.bilibili.com/672342685"
    BELLA = "https://space.bilibili.com/672353429"
    AVA = "https://space.bilibili.com/672346917"

    EmojiCharac = {
        "流汗黄豆": "😅",
        "愤怒黄豆": "😡",
        "笑哭黄豆": "🤣",
        "皇家小丑": "🤡",
        "黄拳头": "👊",
        "白拳头": "👊🏻",
        "大哭黄豆": "😭",
        "给心心": "[给心心]",
        "愤怒恶魔": "👿",
        "口水黄豆": "🤤",
        "鲨鲨鲨": "🦈",
        "大哭": "[大哭]",
        "眼睛": "👀",
        "三心黄豆": "🥰",
        "双心黄豆": "😍",
        "单心黄豆": "😘",
        "摆手黄豆": "🤗",
        "润": "🏃",
        "害怕黄豆": "😰",
        "大笑": "😄",
        "寄吧": "🎤",
        "天使黄豆": "😇",
        "惊恐黄豆": "😱",
        "开香槟": "🍾",
        "奶瓶": "🍼",
        "生气": "[生气]",
        "舔爆": "👅",
        "失望黄豆": "😧",
        "我不好说卧槽": "🤭",
        "烧": "🥵",
        "跳舞": "💃",
        "高跟鞋": "👠",
        "击剑": "🤺",
        "哦呼": "[哦呼]",
        "狗头": "[doge]",
        "嘴硬": "[傲娇]",
        "笑哭": "[笑哭]",
        "抱拳": "[抱拳]",
        "无语": "[无语]",
        "嘉门": "[保佑]"
    }
